# CannotIntersectSiteRegions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..CannotIntersectSiteRegions Property
BuiltInFailures..::..SiteFailures Class See Also
---
Subregions cannot intersect.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotIntersectSiteRegions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotIntersectSiteRegions As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotIntersectSiteRegions {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace